<template>
	<div class="agreement-box">
		<v-header title="爱蜂享服务协议"></v-header>
		<p class="detail">
			<pre style="white-space: pre-wrap">
爱蜂享服务协议
第一条 特别提示
1、安徽地华科技有限公司（以下简称“地华科技”）在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《爱蜂享服务协议》（以下简称“协议”），确保您充分理解本协议中各条款，包括免除地华科技责任的条款及限制用户权利的条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
2、本协议约定地华科技与用户之间关于“爱蜂享”软件服务（以下简称“服务”）的权利义务。“用户”是指注册、 登录、使用本服务的个人。本协议可由地华科技随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在爱蜂享APP查阅最新版协议条款。在地华科技修改协议条款后，如果用户不接受修改后的条款，请立即停止使用爱蜂享提供的服务，用户继续使用爱蜂享提供的服务将被视为接受修改后的协议。
第二条 账号注册
1、用户在使用本服务前需要注册一个“爱蜂享”账号。“爱蜂享”账号应当使用手机号码绑定注册，请用户使用尚未与“爱蜂享”账号绑定的手机号码，以及未被爱蜂享根据本协议封禁的手机号码注册“爱蜂享”账号。爱蜂享可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。
2、如果注册申请者有被爱蜂享封禁的先例或涉嫌虚假注册及滥用他人名义注册，及其他不能得到许可的理由，爱蜂享将拒绝其注册申请。
3、注册成功后，用户可以通过“爱蜂享”软件中“我的账号”界面浏览或更改本人的个人信息。 
4、用户注册时所填写的个人信息如有变动，用户需通过“我的账号”界面及时更改。用户因未及时更改造成的损失爱蜂享概不负责。
第三条 服务内容
1、本服务的具体内容由爱蜂享根据实际情况提供，包括但不限于：
（1）广告投放：用户安装运行“爱蜂享”软件后可在软件界面查看并分享广告；
（2）佣金制：完成本协议第四条相关规定的用户可获得佣金奖励；
（3）佣金兑换：用户可以使用所获佣金兑换爱蜂享里的佣金商城所提供的商品及服务。
2、在遵守相关法律法规前提下，根据合作广告主的要求，爱蜂享有权决定用户在“爱蜂享”软件界面上看到的广告内容。
3、用户使用获得的佣金能够兑换的商品及服务的种类与兑换价格由地华科技全权决定。
第四条 使用规则
1、用户需从官方渠道下载安装地华科技提供的“爱蜂享”软件（APP）。
2、用户安装运行“爱蜂享”软件后，分享广告、热门文章或者分享购的商品等均可获取佣金。
3、用户可以在“爱蜂享”软件中查看自己累计的佣金情况。
4、用户“爱蜂享”软件中显示的累计佣金数量可能与爱蜂享服务器端存在统计差异，实际佣金数量以服务器端为准。
5、用户佣金作为“爱蜂享”软件中的虚拟记录符号，不能在用户间相互转让， 不能使用包括人民币在内的任何法定货币购买，不具有在“爱蜂享”软件以外的环境中进行交易结算的功能。
第五条 佣金兑换
1、用户可以用获得的佣金来兑换“爱蜂享”软件中所提供的商品及服务。该商品及服务均由地华科技合作商提供。
2、用户使用佣金兑换商品及服务后，如出现商品及服务的质量问题，由地华科技合作商负责解决，地华科技不承担相关责任。由此产生的纠纷及诉讼与地华科技无关。
3、用户只有完成手机号注册流程之后才能用获得的佣金兑换上述商品及服务。 使用第三方登录而未完成手机号绑定的用户无法进行佣金兑换。
第六条 佣金累计及佣金有效期
1、如果用户的累计佣金数量出现错误，用户可以自出现错误之日起90天以内向地华科技提出更正要求，地华科技如果确定该用户的要求为正当合理，应在用户提出要求之日起90天以内更正错误。
2、如果用户采用擅自更改“爱蜂享”软件程序或通过刷机刷量等技术手段邀请虚假用户或在没有充分告知其他潜在用户的情况下使得该潜在用户虽然安装了“爱蜂享”软件但没有正常使用行为的或使用黑客手段攻击爱蜂享服务器等不正当手段来获取佣金，地华科技视为用户作弊行为而有权取消该用户资格并删除该用户所有佣金，并保留对攻击爱蜂享服务器等黑客行为追究法律责任的权力。
3、长期不运行“爱蜂享”软件的用户（非活跃用户）所获得积分自动被清零。 长期不运行指3个月内没有运行“爱蜂享”软件。
第七条 用户账户安全
1、注册用户的登陆密码由用户来负责，用户不应把自己的密码告诉其他第三者。
2、如用户没有完成手机号注册流程，仍然继续使用“爱蜂享”软件，用户可以使用第三方（例如QQ、微信等）登陆。用户需尽快完成手机号的绑定。
3、用户如果遗失自己的登陆密码，需及时通知爱蜂享平台，并按照平台的指导来解决该问题。出现第七条第2条的情况下，如果该用户没有完成手机号的绑定导致账户佣金丢失，地华科技对此不负任何责任。
第八条 服务的变更、中断、终止
1、因设备维修或更换、故障和通信中断等技术原因而中断业务，地华科技可视情况事前或事后通知用户。
2、地华科技临时中断业务时将在爱蜂享网站公告。
3、如果因地华科技临时中断业务而导致用户佣金数据丢失，地华科技会给予丢失数据的用户相应的佣金补偿，具体补偿佣金数量由地华科技决定。但因不可抗力导致的业务中断发生时，地华科技不给予用户补偿。
4、当爱蜂享用户发生如下情况时，地华科技可单方面终止本协议，取消用户继续使用爱蜂享产品及服务的资格：
（1）用户死亡；
（2）盗用他人的个人信息或手机；
（3）注册用户时提供虚假信息；
（4）以非法手段（包括且不限于黑客攻击等）来积累或使用积分；
（5）妨碍其他用户的正常使用；
（6）伪称是地华科技的工作人员或管理人员；
（7）擅自强行更改地华科技的计算机系统，或威胁侵入系统；
（8）擅自传播谣言，用各种手段来毁损地华科技的名誉与妨碍地华科技的正常营业；
（9）利用地华科技的产品及服务宣传垃圾广告；
（10）其他违反本协议的行为及违法行为。
（11）用户如因上述第4-（1）条原因而被取消用户资格，用户法定财产继承人可在用户资格被取消之日起30日 内向地华科技提出书面申请，将该用户剩余佣金转移至自己所有的爱蜂享账号下，否则地华科技有权删除该用户剩余佣金。
（12）用户如因上述第4-（2）条到第4-（10）条的原因而被取消用户资格，地华科技有权立即删除该用户的全部积分。
第九条 用户个人隐私信息保护
1、地华科技未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：
（1）地华科技根据法律法规规定或有关机关的指示提供用户的个人隐私信息；
（2）由于用户将其用户密码告知他人或与他人共享注册帐户与密码，由此导致的任何个人信息的泄漏，或其他非因地华科技原因导致的个人隐私信息的泄露；
（3）用户自行向第三方公开其个人隐私信息；
（4）用户与地华科技及合作单位之间就用户个人隐私信息的使用公开达成约定，地华科技因此向合作单位公开用户个人隐私信息；
（5）任何由于黑客攻击、电脑病毒侵入及其他非因地华科技原因导致用户个人隐私信息的泄露。
2、用户同意地华科技可在以下事项中使用用户的个人隐私信息：
（1）向用户及时发送重要通知，如软件更新、本协议条款的变更；
（2）地华科技内部进行审计、数据分析和研究等，以改进地华科技的产品、服务和与用户之间的沟通；
（3）依本协议约定，地华科技管理、审查用户信息及进行处理措施；
（4）适用法律法规规定的其他事项。
第十条 用户使用规范
1、爱蜂享用户不能利用爱蜂享账号或爱蜂享提供的服务进行如下行为：
（1）用户擅自更改、消除或毁损爱蜂享广告业务提供的各种信息；
（2）利用技术手段批量建立虚假账号；
（3）侵害爱蜂享以及第三者的知识产权；
（4）提交、发布虚假信息，或盗用他人资料，冒充、利用他人名义；
（5）未经地华科技许可而传播广告或淫秽暴力等信息；
（6）其他不遵守本协议的行为；
（7）其他违法以及不正当的行为。
 第十一条 免责条款
1、爱蜂享提供的服务中包括广告，用户同意在使用过程中显示爱蜂享与第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，地华科技不承担任何责任。
2、用户需对自己在跳蚤市场中发布的信息承担全部责任，与爱蜂享平台和地华科技无关，如用户因依其中信息进行的交易而遭受的损失或损害，请自行与对方交涉或者拨打报警电话。
 第十二条 知识产权保护
1、爱蜂享的商标、广告业务以及所提供的有关广告内容的知识产权都归属于地华科技。用户从爱蜂享获得的信息内容不经地华科技的许可不能擅自复制、发布与出版。
 第十三条 其他
1、地华科技郑重提醒用户注意本协议中免除地华科技责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。
2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和地华科技之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交地华科技住所地有管辖权的人民法院管辖。
3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。
4、本协议的版权由地华科技所有，地华科技和爱蜂享平台保留一切解释和修改的权力。
5、本协议从2017年9月1日起适用。
</pre>
		</p>
	</div>
</template>

<script>
	import Header from '@/common/vue/Header'
	export default {
		components: {
			'v-header': Header
		}
	}
</script>

<style lang="less">
	.agreement-box {
		padding-top: 44px;
		.detail {
			padding: 12px;
			font-size: 16px;
			color: #343434;
		}
	}
</style>